<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"a10537062ae25ece3f628a056e01011f6ce83ea3ce37bf5a44029e9560c30d83","plan_job_ref":"Job Run Terraform plan in staging #93 at https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/12142852326","plan_out_hash":"d513222ec6dad2fed1289872d501556a39f6087d3e79f055c1e15920a2cee5e7","plan_hash":"85f29d90cd8e6857d308b297b93bab096766c827a2e380fd819ca42512773dd2","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __terraform/staging__
<details>
<summary>Plan: 0 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # cloudfoundry_network_policy.egress_policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "egress_policy" {
        id = "7f21bf69-88b7-d2fa-dbf2-8619556ea327"

-       policy {
-           destination_app = "009f1e51-e36c-40c1-a848-47802d009295" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "776e8975-2df7-414f-abae-71d804c079a4" -> null
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = "776e8975-2df7-414f-abae-71d804c079a4"
        }
    }

  # module.egress_proxy.cloudfoundry_app.egress_app will be updated in-place
!~  resource "cloudfoundry_app" "egress_app" {
!~      created_at                  = "2024-12-03T14:25:45Z" -> (known after apply)
!~      disk_quota                  = "2048M" -> (known after apply)
!~      health_check_type           = "port" -> (known after apply)
!~      id                          = "************************************" -> (known after apply)
!~      log_rate_limit_per_second   = "-1" -> (known after apply)
        name                        = "tfm-egress-proxy-staging"
!~      path                        = ".terraform/modules/egress_proxy/egress_proxy/proxy.zip" -> "/tmp/terraform-data-dir/modules/egress_proxy/egress_proxy/proxy.zip"
!~      readiness_health_check_type = "process" -> (known after apply)
!~      source_code_hash            = "668ecddeb6958eb095307480d5f042ecf1fc391ba0676fe0343b40d315d750ff" -> "f90ec730b6d8f3dce4c866d2030b8b1432e0d813583b0c8562e5535465a96d2a"
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2024-12-03T14:26:14Z" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Run Terraform plan in staging #93](https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/12142852326)